package com.yundao.core.code.config;

/**
 * crm编码
 *
 * @author wupengfei wupf86@126.com
 *
 */
public interface CrmCode {

	/**
	 * 
	 */
	int CRM_10000 = 10000;

	/**
	 * 活动内容的长度必须在{min}到{max}之间
	 */
	int CRM_10001 = 10001;

	/**
	 * 客户来源的长度必须在{min}到{max}之间
	 */
	int CRM_10002 = 10002;

	/**
	 * 手机的长度必须在{min}到{max}之间
	 */
	int CRM_10003 = 10003;

	/**
	 * 证件号码的长度必须在{min}到{max}之间
	 */
	int CRM_10004 = 10004;

	/**
	 * 开户行的长度必须在{min}到{max}之间
	 */
	int CRM_10005 = 10005;

	/**
	 * 证件图片的长度必须在{min}到{max}之间
	 */
	int CRM_10006 = 10006;

	/**
	 * 备注的长度必须在{min}到{max}之间
	 */
	int CRM_10007 = 10007;

	/**
	 * 座机电话的长度必须在{min}到{max}之间
	 */
	int CRM_10008 = 10008;

	/**
	 * 微信电话的长度必须在{min}到{max}之间
	 */
	int CRM_10009 = 10009;

	/**
	 * 传真的长度必须在{min}到{max}之间
	 */
	int CRM_10010 = 10010;

	/**
	 * 区编号的长度必须在{min}到{max}之间
	 */
	int CRM_10011 = 10011;

	/**
	 * 行业的长度必须在{min}到{max}之间
	 */
	int CRM_10012 = 10012;

	/**
	 * 公司机构的长度必须在{min}到{max}之间
	 */
	int CRM_10013 = 10013;

	/**
	 * 职位的长度必须在{min}到{max}之间
	 */
	int CRM_10014 = 10014;

	/**
	 * 年收入的长度必须在{min}到{max}之间
	 */
	int CRM_10015 = 10015;

	/**
	 * 工作年限的长度必须在{min}到{max}之间
	 */
	int CRM_10016 = 10016;

	/**
	 * 购买记录的长度必须在{min}到{max}之间
	 */
	int CRM_10017 = 10017;

	/**
	 * 经理名称的长度必须在{min}到{max}之间
	 */
	int CRM_10018 = 10018;

	/**
	 * 合同附件的长度必须在{min}到{max}之间
	 */
	int CRM_10019 = 10019;

	/**
	 * 打款凭条的长度必须在{min}到{max}之间
	 */
	int CRM_10020 = 10020;

	/**
	 * 成交金额不能为空
	 */
	int CRM_10021 = 10021;

	/**
	 * 订单来源不能为空
	 */
	int CRM_10022 = 10022;

	/**
	 * 客户id有误
	 */
	int CRM_10023 = 10023;

	/**
	 * 联系人id有误
	 */
	int CRM_10024 = 10024;

	/**
	 * 机构id有误
	 */
	int CRM_10025 = 10025;

	/**
	 * 预约id有误
	 */
	int CRM_10026 = 10026;

	/**
	 * 工作流实例id有误
	 */
	int CRM_10027 = 10027;

	/**
	 * 工作流任务id有误
	 */
	int CRM_10028 = 10028;

	/**
	 * 兴趣爱好的长度必须在{min}到{max}之间
	 */
	int CRM_10029 = 10029;

	/**
	 * 创建者机构id有误
	 */
	int CRM_10030 = 10030;

	/**
	 * 拥有者机构id有误
	 */
	int CRM_10031 = 10031;

	/**
	 * 客户类型有误
	 */
	int CRM_10032 = 10032;

	/**
	 * 公海类型有误有误
	 */
	int CRM_10033 = 10033;

	/**
	 * 意见的长度必须在{min}到{max}之间
	 */
	int CRM_10035 = 10035;

	/**
	 * 核对内容的长度必须在{min}到{max}之间
	 */
	int CRM_10036 = 10036;

	/**
	 * 产品名称的长度必须在{min}到{max}之间
	 */
	int CRM_10037 = 10037;

	/**
	 * 供应商名称的长度必须在{min}到{max}之间
	 */
	int CRM_10038 = 10038;

	/**
	 * 部门的长度必须在{min}到{max}之间
	 */
	int CRM_10039 = 10039;

	/**
	 * 账号的长度必须在{min}到{max}之间
	 */
	int CRM_10040 = 10040;

	/**
	 * 收款单位的长度必须在{min}到{max}之间
	 */
	int CRM_10041 = 10041;

	/**
	 * 确认函的长度必须在{min}到{max}之间
	 */
	int CRM_10042 = 10042;

	/**
	 * 付款摘要的长度必须在{min}到{max}之间
	 */
	int CRM_10043 = 10043;

	/**
	 * 下次跟进内容的长度必须在{min}到{max}之间
	 */
	int CRM_10044 = 10044;

	/**
	 * 接收人的长度必须在{min}到{max}之间
	 */
	int CRM_10045 = 10045;

	/**
	 * 客户id有误
	 */
	int CRM_10046 = 10046;

	/**
	 * 跟进时间有误
	 */
	int CRM_10047 = 10047;

	/**
	 * 跟进方式有误
	 */
	int CRM_10048 = 10048;

	/**
	 * 跟进状态有误
	 */
	int CRM_10049 = 10049;

	/**
	 * 跟进内容的长度必须在{min}到{max}之间
	 */
	int CRM_10050 = 10050;

	/**
	 * 操作前的内容的长度必须在{min}到{max}之间
	 */
	int CRM_10051 = 10051;

	/**
	 * 操作后的内容的长度必须在{min}到{max}之间
	 */
	int CRM_10052 = 10052;

	/**
	 * 证件类型有误
	 */
	int CRM_10053 = 10053;

	/**
	 * 身份证图片的长度必须在{min}到{max}之间
	 */
	int CRM_10054 = 10054;

	/**
	 * 付款金额有误
	 */
	int CRM_10055 = 10055;

	/**
	 * 订单id有误
	 */
	int CRM_10056 = 10056;

	/**
	 * 产品id有误
	 */
	int CRM_10057 = 10057;

	/**
	 * 供应商id有误
	 */
	int CRM_10058 = 10058;

	/**
	 * 产品类型的长度必须在{min}到{max}之间
	 */
	int CRM_10059 = 10059;

	/**
	 * 您分配客户时所选择的客户类型有误
	 */
	int CRM_10060 = 10060;

	/**
	 * 您分配客户时所选择的客户已分配
	 */
	int CRM_10061 = 10061;

	/**
	 * 订单编号的长度必须在{min}到{max}之间
	 */
	int CRM_10062 = 10062;

	/**
	 * 预约产品时请先选择销售机会
	 */
	int CRM_10063 = 10063;

	/**
	 * 售前咨询不能预约
	 */
	int CRM_10064 = 10064;

	/**
	 * 您已预约请等待处理
	 */
	int CRM_10065 = 10065;

	/**
	 * 仅有效的销售机会才可以预约
	 */
	int CRM_10066 = 10066;

	/**
	 * 产品id有误
	 */
	int CRM_10067 = 10067;

	/**
	 * 产品名字的长度必须在{min}到{max}之间
	 */
	int CRM_10068 = 10068;

	/**
	 * 产品类型的长度必须在{min}到{max}之间
	 */
	int CRM_10069 = 10069;

	/**
	 * 咨询id有误
	 */
	int CRM_10070 = 10070;

	/**
	 * 供应商id有误
	 */
	int CRM_10071 = 10071;

	/**
	 * 供应商名称的长度必须在{min}到{max}之间
	 */
	int CRM_10072 = 10072;

	/**
	 * 预约金额有误
	 */
	int CRM_10073 = 10073;

	/**
	 * 打款时间有误
	 */
	int CRM_10074 = 10074;

	/**
	 * 预约id有误
	 */
	int CRM_10075 = 10075;

	/**
	 * 用户id有误
	 */
	int CRM_10076 = 10076;

	/**
	 * 打款时间不能为空
	 */
	int CRM_10077 = 10077;

	/**
	 * 订单id有误
	 */
	int CRM_10078 = 10078;

	/**
	 * 产品发行机构名称的长度必须在{min}到{max}之间
	 */
	int CRM_10079 = 10079;

	/**
	 * 客户手机号已存在
	 */
	int CRM_10080 = 10080;

	/**
	 * 附件类型有误
	 */
	int CRM_10081 = 10081;

	/**
	 * 产品预约没有成功，暂不能转订单
	 */
	int CRM_10082 = 10082;

	/**
	 * 预约已转订单
	 */
	int CRM_10083 = 10083;

	/**
	 * 请先分配客户
	 */
	int CRM_10084 = 10084;

	/**
	 * 表不能为空
	 */
	int CRM_10085 = 10085;

	/**
	 * 字段不能为空
	 */
	int CRM_10086 = 10086;

	/**
	 * 客户等级有误
	 */
	int CRM_10087 = 10087;

	/**
	 * 投资偏好有误
	 */
	int CRM_10088 = 10088;

	/**
	 * 性别有误
	 */
	int CRM_10089 = 10089;

	/**
	 * 回访时间有误
	 */
	int CRM_10090 = 10090;

	/**
	 * 回访方式有误
	 */
	int CRM_10091 = 10091;

	/**
	 * 回访状态有误
	 */
	int CRM_10092 = 10092;

	/**
	 * 回访内容的长度必须在{min}到{max}之间
	 */
	int CRM_10093 = 10093;

	/**
	 * 回访等级有误
	 */
	int CRM_10094 = 10094;

	/**
	 * 下次回访内容的长度必须在{min}到{max}之间
	 */
	int CRM_10095 = 10095;

	/**
	 * 下次回访时间有误
	 */
	int CRM_10096 = 10096;

	/**
	 * 客户已经存在
	 */
	int CRM_10097 = 10097;

	/**
	 * 订单不能申请付款
	 */
	int CRM_10098 = 10098;

	/**
	 * 订单已申请付款
	 */
	int CRM_10099 = 10099;

	/**
	 * 付款id有误
	 */
	int CRM_10100 = 10100;

	/**
	 * 付款审批id
	 */
	int CRM_10101 = 10101;

	/**
	 * 订单付款申请已处理
	 */
	int CRM_10102 = 10102;

	/**
	 * 订单审批的状态有误
	 */
	int CRM_10103 = 10103;

	/**
	 * 产品应回款有误
	 */
	int CRM_10104 = 10104;

	/**
	 * 产品本次回款有误
	 */
	int CRM_10105 = 10105;

	/**
	 * 产品已添加回款，请追加回款
	 */
	int CRM_10106 = 10106;

	/**
	 * 产品回款id有误
	 */
	int CRM_10107 = 10107;

	/**
	 * 区域省份数据为空
	 */
	int CRM_10108 = 10108;

	/**
	 * 订单未审核通过
	 */
	int CRM_10109 = 10109;

	/**
	 * 产品未全部回款
	 */
	int CRM_10110 = 10110;

	/**
	 * 此产品还没有订单
	 */
	int CRM_10111 = 10111;

	/**
	 * 回款公司的长度必须在{min}到{max}之间
	 */
	int CRM_10112 = 10112;

	/**
	 * 回款银行的长度必须在{min}到{max}之间
	 */
	int CRM_10113 = 10113;

	/**
	 * 删除失败，所选的数据存在已被删除的数据
	 */
	int CRM_10114 = 10114;

	/**
	 * 删除失败，所选的数据存在已被审核的结佣数据
	 */
	int CRM_10115 = 10115;

	/**
	 * 客户邮箱已经存在
	 */
	int CRM_10116 = 10116;

	/**
	 * 客户微信号已经存在
	 */
	int CRM_10117 = 10117;

	/**
	 * 客户QQ号已经存在
	 */
	int CRM_10118 = 10118;

	/**
	 * 手机号、邮箱、QQ、微信不能同时为空
	 */
	int CRM_10119 = 10119;
	
	/**
	 * 销售机会进展不能修改为{statusName}
	 */
	int CRM_10502 = 10502;

}
