package com.yundao.core.code.config;

/**
 * 数据中心编码
 *
 * @author wupengfei wupf86@126.com
 *
 */
public interface DcCode {

	/**
	 * 日志内容的长度必须在{min}到{max}之间
	 */
	int DC_4000 = 4000;

	/**
	 * 埋点编码的长度必须在{min}到{max}之间
	 */
	int DC_4001 = 4001;

	/**
	 * 埋点名称的长度必须在{min}到{max}之间
	 */
	int DC_4002 = 4002;

	/**
	 * 埋点描述的长度必须在{min}到{max}之间
	 */
	int DC_4003 = 4003;

	/**
	 * 埋点链接的长度必须在{min}到{max}之间
	 */
	int DC_4004 = 4004;

	/**
	 * 平台名字的长度必须在{min}到{max}之间
	 */
	int DC_4005 = 4005;

	/**
	 * 目标链接的长度必须在{min}到{max}之间
	 */
	int DC_4006 = 4006;

	/**
	 * 计划名称的长度必须在{min}到{max}之间
	 */
	int DC_4007 = 4007;

	/**
	 * 单元名称的长度必须在{min}到{max}之间
	 */
	int DC_4008 = 4008;

	/**
	 * 关键词的长度必须在{min}到{max}之间
	 */
	int DC_4009 = 4009;

	/**
	 * 创意的长度必须在{min}到{max}之间
	 */
	int DC_4010 = 4010;

	/**
	 * 媒介平台有误
	 */
	int DC_4011 = 4011;

	/**
	 * 平台类型有误
	 */
	int DC_4012 = 4012;

	/**
	 * 用户唯一标识的长度必须在{min}到{max}之间
	 */
	int DC_4013 = 4013;

	/**
	 * 用户id的长度必须在{min}到{max}之间
	 */
	int DC_4014 = 4014;

	/**
	 * 埋点编码有误
	 */
	int DC_4015 = 4015;

	/**
	 * 参数名的长度必须在{min}到{max}之间
	 */
	int DC_4016 = 4016;

	/**
	 * 参数值的长度必须在{min}到{max}之间
	 */
	int DC_4017 = 4017;

	/**
	 * 活动id有误
	 */
	int DC_4018 = 4018;

	/**
	 * 活动已停止
	 */
	int DC_4019 = 4019;

	/**
	 * 活动尚未开始
	 */
	int DC_4020 = 4020;

	/**
	 * 您已报名，请勿重复提交
	 */
	int DC_4021 = 4021;

	/**
	 * 用户id的长度必须在{min}到{max}之间
	 */
	int DC_4022 = 4022;
	
	/**
	 * 预约标识有误
	 */
	int DC_4023 = 4023;

	/**
	 * 版本号的长度必须在{min}到{max}之间
	 */
	int DC_4024 = 4024;
	
}
